apitests/doesRegistrationUserIdExist.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" >
 <soap:Body>
  <doesRegistrationUserIdExist_Key xmlns="https://secure.textkey.com/services/">
   <apiKey>PUT API KEY HERE</apiKey>
   <userID>BobSmithUID</userID>
   <isHashed>true</isHashed>
  </doesRegistrationUserIdExist_Key>
 </soap:Body>
</soap:Envelope>
